[{"id":"16","title":"My Site","link":"http://vanessapoppe.me/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/my-site.png","tags":["Node.js","React","SCSS"],"gitHubLink":"https://github.com/vanessacor/my-site","date":"08/01/2020","deploy":"AWS - S3","description":"<p>As soon as I started my webdev learning journey I built a static web site to host all the projects I was doing. It was a simple HTML page, with basic CSS, and small bits of Javascript, and it was hosted on GitHub pages.</p>\n<p>At this point I felt that I could start tasting the waters in the job market and decided to invest in building a proper website, where I can introduce myself, as well as showcase my work.</p>\n<p>The decision of building it with React was based only in the fact that I wanted to consolidate my React skills.</p>\n<p>The content is written in [Markdown files](link!!! To the girth content/ folder), with a bit of &quot;front matter&quot; to store metadata. The content is read at build time by a little [npm script](link!!! To GitHub src file) that relies on <a href=\"https://www.npmjs.com/package/markdown-it\">markdown.it</a> to handle the markdown to html conversion and then stores it in a local json file.</p>\n<p>This allows me to easily to keep my list of projects updated. And it was also fun to build!</p>\n<p>It's deployed on <a href=\"https://aws.amazon.com/s3/?nc=sn&amp;loc=0\">AWS S3</a> and distributed on <a href=\"https://aws.amazon.com/cloudfront/?nc2=type_a\">CloudFront</a>.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>Parse markdown files and extract metadata</li>\n<li>AWS - host and deploy a static website on S3;</li>\n<li>Secure a domain using AWS ACM.</li>\n<li>How to use CloudFront to serve the traffic accessed through the domain.</li>\n<li>How to create a cloud distribution using Route 53 and CloudFront.</li>\n<li>Basic and simple configuration of Babel and Webpack.</li>\n</ul>\n"},{"id":"15","title":"My Bookshelf","link":"https://agile-temple-24298.herokuapp.com/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/mybookshelf.png","tags":["Node.js","React","RESTfull API","SCSS"],"gitHubLink":"https://github.com/vanessacor/bookshelf-app","date":"05/28/2020","deploy":"Heroku","description":"<p>This feels like I reach the end of a cycle.\nMy Bookshelf is my first fullStack project!\nI built this React App almost from scratch (I use React Create app) and learnt the basics of working with React like React Router.\nOn the backend side, I created a Restful API using Node.js, express, mongoose.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>React - React Router, React DOM, React Developer Tools, JSX,</li>\n<li>RESTful API - Postman(testing),</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li>I would change the file structure to use the React convenctions</li>\n</ul>\n"},{"id":"14","title":"Meme Generator","link":"https://vanessacor.github.io/meme-generator/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/meme-generator.png","tags":["Node.js","React","SASS"],"gitHubLink":"https://github.com/vanessacor/meme-generator","date":"04/09/2020","deploy":"GitHub Pages","description":"<p>Heard some much about React and how it is important today for a front-end developer to know how to work with. After searching for some tutorial I chose to follow <a href=\"https://scrimba.com/g/glearnreact\">this great tutorial </a> by Bob Ziroll.\nThis simple page is a meme generator built with Create React APP, it takes two text inputs, to be displayed at the top and bottom of the image. The user has the choice to change the image randomly.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>React - props and state, components and class components, lifecycle methods, fetching data from API.</li>\n</ul>\n"},{"id":"13","title":"My Books","link":"https://pacific-hamlet-13856.herokuapp.com/catalog","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/mybooks.png","tags":["Node.js","Express","MongoDB","SASS"],"gitHubLink":"https://github.com/vanessacor/bookeshelf","date":"03/30/2020","deploy":"Heroku","description":"<p>After learning the basics of node.js and express with this tutorial, I decided to rebuild <a href=\"https://vanessacor.github.io/site/experiments/library/\">My Library</a> now with node.js, express, EJS and MongoDB.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>MongoDB - CRUD</li>\n<li>Express - models, views and controllers (MVC), routes.</li>\n<li>JavaScript - promises, ES6 best practices;</li>\n<li>SASS - best practices, variables, mixins.</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li></li>\n</ul>\n"},{"id":"12","title":"Misstee","link":"https://vanessacor.github.io/site/experiments/games/misstee/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/misstee.png","tags":["HTML","Canvas","JavaScript","OPP"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/games/misstee","date":"02/01/2020","deploy":"GitHub Pages","description":"<p>After learning a bit on how to work with HTML Canvas, I decided to adventure myself on making my own canvas html game! The game takes inspiration from our lovely and sweet one ear cat Misstee and her love for shrimps.</p>\n<p>The game is very simple, Misstee has to try to eat all the shrimps she can while avoiding the poisoned chocolates. As the game advances the number of shrimps and chocolates on the screen increase making it more difficult to play.</p>\n<h4>Annoying bug</h4>\n<p>It was a challenge to debug in canvas because a lot of things happen in the same frame. The game had this very annoying bug, it seemed that at some random times the player would lose all its lives at once or earn 20 points at once. It took a while to figure this out, because it seemed so random. It turned out to be a very simple mistake that I made in an array.splice method.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>JavaScript - drawing and animating on canvas. OOP, classes and methods.</li>\n</ul>\n"},{"id":"11","title":"Canvas","link":"https://vanessacor.github.io/site/experiments/canvas/canvas-art/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/canvasArt.png","tags":["HTML","Canvas","JavaScript"],"gitHubLink":"https://github.com/vanessacor/site/blob/master/experiments/canvas/canvas-art/script.js","date":"01/12/2020","deploy":"GitHub Pages","description":"<p>Canvas is fun! I made these pages by following the tutorials from <a href=\"https://www.youtube.com/watch?v=EO6OkltgudE&amp;feature=youtu.be\">Chris Courses</a></p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>\n<p>HTML - canvas</p>\n</li>\n<li>\n<p>JavaScript - drawing on canvas and basic animations.</p>\n</li>\n</ul>\n"},{"id":"10","title":"Library","link":"https://vanessacor.github.io/site/experiments/library/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/my-books.png","tags":["HTML","CSS","JavaScript","BDD"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/library","date":"09/12/2019","deploy":"GitHub Pages","description":"<p>After finishing the front-end module of the 101 web-development I jump into the <a href=\"https://www.theodinproject.com/courses/javascript\">JavaScript course</a>. This was the first project my first experience with Object-oriented programming - OOP.</p>\n<p>The challenge was to create a simple library app. The user can add books with its title, author, genre and status. Users can delete and edit books.\nI used the behavioral test driven approach for the business logic.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>JavaScript - objects and object constructor, properties and methods.</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li><a href=\"https://pacific-hamlet-13856.herokuapp.com/catalog\">This</a>.</li>\n</ul>\n"},{"id":"9","title":"Calculator","link":"https://vanessacor.github.io/site/experiments/calculator/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/calculator.png","tags":["HTML","CSS","JavaScript","BDD","Jasmine"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/calculator","date":"08/12/2019","deploy":"GitHub Pages","description":"<p>To finish my Javascript module of the <a href=\"https://www.theodinproject.com/courses/web-development-101\">Web development 101</a> I was asked to make an on-screen calculator using JavaScript, HTML, and CSS.</p>\n<p>This was my first project using BDD and although at first I struggled it helped me a lot to write the functions.</p>\n<p>This online calculador has the basic math operators but it doesn’t follow the order of operations (PEMDAS) meaning that all the operations are done by a pair of numbers being evaluated at a time.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>Separate business logic from UI (event handlers, update dom).</li>\n<li>JavaScript - arrays methods, loop and conditional statements, debugging (dev-tools), BDD using jasmine.</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li>I would try to implement PEMDAS and would add more complex operations.</li>\n</ul>\n"},{"id":"8","title":"Cash Register","link":"https://vanessacor.github.io/site/experiments/cash-register/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/cash-register.png","tags":["HTML","CSS","JavaScript"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/cash-register","date":"07/02/2019","deploy":"GitHub Pages","description":"<p>The challenge was to build a cash register for an imaginary coffee shop. The user can choose a category from a set list, enter a description and the price (amount).\nThe items are added to a list and the total amount is sum. The user can then delete items from the list and the total is updated.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>DOM manipulation (create an element, set attribute, add class)</li>\n<li>JavaScript (arrays, events, scope, functions)</li>\n<li>Separate business logic from UI (event handlers, update dom) code</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li>I would had more features, like the possibility to edit an item, to add categories.</li>\n</ul>\n"},{"id":"7","title":"Utopian News","link":"https://vanessacor.github.io/site/experiments/utopian/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/utopian.png","tags":["HTML","CSS","JavaScript"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/utopian","date":"06/04/2019","deploy":"GitHub Pages","description":"<p>This page was inspired by my youngest son and his love for History and alternative history. This is a newspaper website for the fictional Utopian Country.</p>\n<p>The page has a header with a navbar, a main element with sections and articles and a footer with info about the newspaper.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>For the layout I used the CSS Grid Layout.</li>\n<li>I also learnt a bit more about Javascript specifically about date formatting. I know this can be done with libraries such as <em>moment</em> but I wanted to try by myself.</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li>In terms of responsiveness a lot can be improved and also the html structure needs to be changed in order to be easier to style it.</li>\n</ul>\n"},{"id":"6","title":"Etch-a-Sketch","link":"https://vanessacor.github.io/site/experiments/etch-a-sketch/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/etch-a-sketch.png","tags":["HTML","CSS","JavaScript"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/games/rock-paper-scissors","date":"05/21/2019","deploy":"GitHub Pages","description":"<p>On my third project for <a href=\"https://www.theodinproject.com/courses/web-development-101\">Odin Project</a> I was asked to <em>“build a browser version of something between a sketchpad and an Etch-A-Sketch”</em> to flex my DOM manipulation skills.</p>\n<p>This is a single page where at the top the user chooses the size of the grid, meaning how many squares per line before they start painting. Once the mouse hovers over the grid-container, the squares are <em>painted</em>. The user can choose between color-off mode (the squares will be in grayscale) and color-on mode (the colors are randomized).</p>\n<p>I had a lot of fun with this one and hope you enjoy it.</p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>HTML - DOM API, append and remove elements, setAttribute, set style and classes;</li>\n<li>Javascript - DevTools to debug;</li>\n<li>CSS - CSS Grid Layout,</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li>I believe now that this type of project would work better if it was built with canvas, but only later I found it out that you can literally draw with Javascript.</li>\n</ul>\n"},{"id":"5","title":"Concrete Surfers","link":"https://vanessacor.github.io/site/experiments/concrete-surfers/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/concrete-surfers.png","tags":["HTML","CSS","JavaScript"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/concrete-surfers","date":"04/04/2019","deploy":"GitHub Pages","description":"<p>The challenge here was to create a simple landing page with HTML, CSS and javascript, with some simple form registration.</p>\n<p>I researched and learnt about landing pages, the good practices, what to include and how to include.</p>\n<p>I created a fake Concrete Surfers community, inspired by one of my hobbies, skateboarding.</p>\n<p>I imagined a simple page with the goal to build a community of people who like to skateboard and wanted to find other people to go out and skateboard together.</p>\n<p>The page has a brief description of the community followed by the registration form for contact details. The page also displays some testimonies from trustees and at the bottom a video is displayed.</p>\n<p><em>note: Yes, it's me in the video almost crashing 😃.</em></p>\n<h4>What have I learnt:</h4>\n<ul>\n<li>UI - what’s a landing page and best practices when creating one;</li>\n<li>HTML - DOM API;</li>\n<li>JavaScript - form validation, events listeners;</li>\n<li>CSS - positioning (place a play button on video element), flexbox,</li>\n</ul>\n"},{"id":"4","title":"Rock Paper Scissors","link":"https://vanessacor.github.io/site/experiments/games/rock-paper-scissors/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/rock-paper-scissors.png","tags":["HTML","CSS","JavaScript"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/games/rock-paper-scissors","date":"03/14/2019","deploy":"GitHub Pages","description":"<p>This was another assignment for the <a href=\"https://www.theodinproject.com/courses/web-development-101\">Odin Project</a>. I was asked to create the classic game of Rock Paper Scissors that would be played on the console. I decided that this was a chance for me to integrate everything I had learned to that point. I built this game using HTML, CSS and JavaScript.</p>\n<p>It's a user versus computer game. The user first makes their choice by clicking in one of the three choices, and then a timeout is triggered so the user has the &quot;feeling&quot; of time. The result for the round is displayed and the score updated. When one of the players reaches 5 points the game is over and the winner is announced. A reset button is displayed so the user can start a new game.</p>\n<p>I learnt so much javascript doing this project. I remember how hard it was for me to understand some of the core concepts of JS (arguments, parameters, template literals) and after this project I felt like suddenly everything made sense (well... maybe not everything).</p>\n<p>I am really proud of myself and have to thank the help of Andre and the coaches from <a href=\"https://codebar.io/barcelona\">CodeBar Barcelona</a>.</p>\n<h4>What I have learnt:</h4>\n<ul>\n<li>JavaScript - conditional operators, functions (declaration, parameters and return value), arrow functions, loops, template literals, set time out;</li>\n<li>CSS - media-queries,</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li>I definitely would separate the business logic from UI logic, that's a distinction that I wasn't aware of at the time</li>\n</ul>\n"},{"id":"3","title":"Photo Gallery","link":"https://vanessacor.github.io/site/experiments/photo-gallery/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/photo-gallery.png","tags":["HTML","CSS","Git/GitHub"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/photo-gallery","date":"03/12/2019","deploy":"GitHub Pages","description":"<p>I wanted to create another static web-page where I would be able to apply my new CSS skills, namely, responsive web-design and mobile first approach.</p>\n<p>I decided that a photo galery of my instagram photos would be a good project.</p>\n<h4>Things I have learnt:</h4>\n<ul>\n<li>HTML - best practices</li>\n<li>CSS - flex box model</li>\n</ul>\n<h4>Things I would do different now:</h4>\n<ul>\n<li>I would try to use instagram API to update this page every time I posted something on my Instagram account.</li>\n</ul>\n"},{"id":"2","title":"African Elephant","link":"https://vanessacor.github.io/site/experiments/african-elephant/","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/african-elephant.png","tags":["HTML","CSS","Git/GitHub"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/african-elephant","date":"02/18/2019","deploy":"GitHub Pages","description":"<p>In order to consolidate my learning of HTML and CSS I created another static webpage, an info page (content from wikipedia) about my favourite animal.</p>\n<p>Because I started learning JavaScript following the curriculum in the Odin Project, I decided to include a go to top button with JS. I looked at examples and adapted to my page.</p>\n<h4>What I have learnt:</h4>\n<ul>\n<li>JavaScript - functions, addEventListeners, if statements, style attributes;</li>\n<li>CSS - model box, responsive web-design.</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li>Looking at the code I definitely would structure the HTML differently, less divs and would use the css selectors more wisely, like not id every element. At the time, it was quite hard for me, and I think sometimes it still is, to know when to apply classes and ids.</li>\n</ul>\n"},{"id":"1","title":"First Layout","link":"https://vanessacor.github.io/site/experiments/my_journey","image":"https://media-vanessapoppe-me.s3-eu-west-1.amazonaws.com/images/screenshots/first-layout.png","tags":["HTML","CSS","Git/GitHub"],"gitHubLink":"https://github.com/vanessacor/site/tree/master/experiments/my_journey","date":"02/11/2019","deploy":"GitHub Pages","description":"<p>When I decided to learn web-development, I found the Odin Project and decided to do the <a href=\"https://www.theodinproject.com/courses/web-development-101\">Web development 101</a>. The first assignment was to clone the Google Homepage, it was a very simple exercise but I remember how much I enjoy seeing my work on the web-browser.\nMy goal was to build a simple Web page with just HTML and CSS using all I had learnt on the first modules of Odin Project Course. I tried to do the simplest thing and play a bit with the colors gradient and box-shadow. My goal was also to document my learning journey weekly but for some reason I got too hooked on coding and didn't make time for the writing.</p>\n<h4>What I have learnt:</h4>\n<ul>\n<li>Git/GitHub - create a repository, clone, add, commit and push;</li>\n<li>HTML - structure and semantics, elements, tags, attributes;</li>\n<li>CSS - elements, selectors, declarations, properties and values;</li>\n<li>How to include google fonts and fontawesome icons.</li>\n</ul>\n<h4>What I would do differently:</h4>\n<ul>\n<li>Design wise I probably would chose another color palette.</li>\n</ul>\n"}]